## Устанавливаем необходимые библиотеки SQL для работы в JN

Устанавливаем MySQL https://dev.mysql.com/downloads/installer/

Устанавливаем необходимые библиотеки:

In [1]:
# !pip install pymysql  # не надо
# !pip install ipython-sql
# !pip install mysqlclient
# !pip install mysql-connector-python  # не надо
# !pip install sqlalchemy

Устанавливаем соединениес MySQL:

In [1]:
import sqlalchemy

In [2]:
sqlalchemy.create_engine("mysql://root:123qwe@localhost/mydb")

Engine(mysql://root:***@localhost/mydb)

In [3]:
%load_ext sql

In [4]:
%sql mysql://root:123qwe@localhost/mydb

### Актуализируем таблицу для урока 1.5:

In [46]:
%%sql
DROP TABLE IF EXISTS book;

CREATE TABLE IF NOT EXISTS book
(
    book_id INT PRIMARY KEY AUTO_INCREMENT,
    title   varchar(50),
    author  varchar(30),
    price   decimal(8, 2),
    amount  int
);

INSERT INTO book(title, author, price, amount)
VALUES ('Мастер и Маргарита', 'Булгаков М.А.', 670.99, 3),
       ('Белая гвардия', 'Булгаков М.А.', 540.50, 5),
       ('Идиот', 'Достоевский Ф.М.', 460.00, 10),
       ('Братья Карамазовы', 'Достоевский Ф.М.', 799.01, 2),
       ('Стихотворения и поэмы', 'Есенин С.А.', 650.00, 15);

 * mysql://root:***@localhost/mydb
0 rows affected.
0 rows affected.
5 rows affected.

[]

In [47]:
%%sql
SELECT * FROM book

 * mysql://root:***@localhost/mydb
5 rows affected.

[(1, 'Мастер и Маргарита', 'Булгаков М.А.', Decimal('670.99'), 3),
 (2, 'Белая гвардия', 'Булгаков М.А.', Decimal('540.50'), 5),
 (3, 'Идиот', 'Достоевский Ф.М.', Decimal('460.00'), 10),
 (4, 'Братья Карамазовы', 'Достоевский Ф.М.', Decimal('799.01'), 2),
 (5, 'Стихотворения и поэмы', 'Есенин С.А.', Decimal('650.00'), 15)]

## 1.5.2 Создание пустой таблицы

Создать таблицу поставка (**supply**), которая имеет ту же структуру, что и таблиц **book**.

| Поле | Тип, описание |
| :- | :-|
| book_id | INT PRIMARY KEY AUTO_INCREMENT |
| title | VARCHAR(50) |
| author | VARCHAR(30) |
| price | DECIMAL(8, 2) |
| amount | INT |

In [25]:
%%sql
CREATE TABLE supply(
    book_id INT PRIMARY KEY AUTO_INCREMENT,
    title   VARCHAR(50),
    author  VARCHAR(30),
    price   DECIMAL(8, 2),
    amount  INT
);

 * mysql://root:***@localhost/mydb
0 rows affected.

[]

In [26]:
%%sql
SELECT * FROM supply

 * mysql://root:***@localhost/mydb
0 rows affected.

[]

## 1.5.3 Добавление записей в таблицу

Занесите в таблицу **supply** четыре записи, чтобы получилась следующая таблица:
  
| supply | title | author | price | amount |
| :- | :-| :-| :-| :-|
| 1 | Лирика | Пастернак Б.Л. | 518.99 | 2 |
| 2 | Черный человек  | Есенин С.А. | 570.20 | 6 |
| 3 | Белая гвардия | Булгаков М.А.| 540.50 | 7 |
| 4 | Идиот| Достоевский Ф.М. | 360.80 | 3 |

In [27]:
%%sql
INSERT INTO supply(title, author, price, amount)
VALUES ('Лирика', 'Пастернак Б.Л.', 518.99, 2),
       ('Черный человек', 'Есенин С.А.', 570.20, 6),
       ('Белая гвардия', 'Булгаков М.А.', 540.50, 7),
       ('Идиот', 'Достоевский Ф.М.', 360.80, 3);

 * mysql://root:***@localhost/mydb
4 rows affected.

[]

In [28]:
%%sql
SELECT * FROM supply

 * mysql://root:***@localhost/mydb
4 rows affected.

[(1, 'Лирика', 'Пастернак Б.Л.', Decimal('518.99'), 2),
 (2, 'Черный человек', 'Есенин С.А.', Decimal('570.20'), 6),
 (3, 'Белая гвардия', 'Булгаков М.А.', Decimal('540.50'), 7),
 (4, 'Идиот', 'Достоевский Ф.М.', Decimal('360.80'), 3)]

## 1.5.4 Добавление записей из другой таблицы

Добавить из таблицы **supply** в таблицу **book**, все книги, кроме книг, написанных Булгаковым М.А. и Достоевским Ф.М.

In [48]:
%%sql
INSERT INTO book (title, author, price, amount) 
SELECT title, author, price, amount
FROM supply
WHERE author NOT IN ('Булгаков М.А.', 'Достоевский Ф.М.');

 * mysql://root:***@localhost/mydb
2 rows affected.

[]

In [49]:
%%sql
SELECT * FROM book

 * mysql://root:***@localhost/mydb
7 rows affected.

[(1, 'Мастер и Маргарита', 'Булгаков М.А.', Decimal('670.99'), 3),
 (2, 'Белая гвардия', 'Булгаков М.А.', Decimal('540.50'), 5),
 (3, 'Идиот', 'Достоевский Ф.М.', Decimal('460.00'), 10),
 (4, 'Братья Карамазовы', 'Достоевский Ф.М.', Decimal('799.01'), 2),
 (5, 'Стихотворения и поэмы', 'Есенин С.А.', Decimal('650.00'), 15),
 (6, 'Лирика', 'Пастернак Б.Л.', Decimal('518.99'), 2),
 (7, 'Черный человек', 'Есенин С.А.', Decimal('570.20'), 6)]

## 1.5.5 Добавление записей, вложенные запросы

Возвращаем таблицу **book** к исходному состоянию.

In [50]:
%%sql
DELETE FROM book ORDER BY book_id DESC LIMIT 2;
ALTER TABLE book AUTO_INCREMENT = 6;

 * mysql://root:***@localhost/mydb
2 rows affected.
0 rows affected.

[]

Занести из таблицы **supply** в таблицу **book** только те книги, авторов которых нет в **book**.

In [51]:
%%sql
INSERT INTO book (title, author, price, amount) 
SELECT title, author, price, amount 
FROM supply
WHERE author NOT IN (
    SELECT author 
    FROM book);

 * mysql://root:***@localhost/mydb
1 rows affected.

[]

In [52]:
%%sql
SELECT * FROM book

 * mysql://root:***@localhost/mydb
6 rows affected.

[(1, 'Мастер и Маргарита', 'Булгаков М.А.', Decimal('670.99'), 3),
 (2, 'Белая гвардия', 'Булгаков М.А.', Decimal('540.50'), 5),
 (3, 'Идиот', 'Достоевский Ф.М.', Decimal('460.00'), 10),
 (4, 'Братья Карамазовы', 'Достоевский Ф.М.', Decimal('799.01'), 2),
 (5, 'Стихотворения и поэмы', 'Есенин С.А.', Decimal('650.00'), 15),
 (6, 'Лирика', 'Пастернак Б.Л.', Decimal('518.99'), 2)]

## 1.5.6 Запросы на обновление

Возвращаем таблицу **book** к исходному состоянию.

In [53]:
%%sql
DELETE FROM book ORDER BY book_id DESC LIMIT 1;
ALTER TABLE book AUTO_INCREMENT = 6;

 * mysql://root:***@localhost/mydb
1 rows affected.
0 rows affected.

[]

Уменьшить на 10% цену тех книг в таблице **book**, количество которых принадлежит интервалу от 5 до 10, включая границы.

In [55]:
%%sql
UPDATE
    book
SET
    price = price * 0.9
WHERE
    amount BETWEEN 5 AND 10

 * mysql://root:***@localhost/mydb
2 rows affected.

[]

In [56]:
%%sql
SELECT * FROM book

 * mysql://root:***@localhost/mydb
5 rows affected.

[(1, 'Мастер и Маргарита', 'Булгаков М.А.', Decimal('670.99'), 3),
 (2, 'Белая гвардия', 'Булгаков М.А.', Decimal('486.45'), 5),
 (3, 'Идиот', 'Достоевский Ф.М.', Decimal('414.00'), 10),
 (4, 'Братья Карамазовы', 'Достоевский Ф.М.', Decimal('799.01'), 2),
 (5, 'Стихотворения и поэмы', 'Есенин С.А.', Decimal('650.00'), 15)]

## 1.5.7 Запросы на обновление нескольких столбцов

Возвращаем таблицу **book** к исходному состоянию.

In [57]:
%%sql
UPDATE
    book
SET
    price = price / 0.9
WHERE
    amount BETWEEN 5 AND 10

 * mysql://root:***@localhost/mydb
2 rows affected.

[]

In [59]:
# Структура и наполнение таблицы book для этого задания:  
# +---------+-----------------------+------------------+--------+--------+-----+  
# | book_id | title                 | author           | price  | amount | buy |  
# +---------+-----------------------+------------------+--------+--------+-----+  
# | 1       | Мастер и Маргарита    | Булгаков М.А.    | 670.99 | 3      | 0   |  
# | 2       | Белая гвардия         | Булгаков М.А.    | 540.50 | 5      | 3   |  
# | 3       | Идиот                 | Достоевский Ф.М. | 460.00 | 10     | 8   |  
# | 4       | Братья Карамазовы     | Достоевский Ф.М. | 799.01 | 2      | 0   |  
# | 5       | Стихотворения и поэмы | Есенин С.А.      | 650.00 | 15     | 18  |  
# +---------+-----------------------+------------------+--------+--------+-----+

В таблице **book** необходимо скорректировать значение для покупателя в столбце **buy** таким образом, чтобы оно не превышало количество экземпляров книг, указанных в столбце **amount**. А цену тех книг, которые покупатель не заказывал, снизить на 10%.

In [ ]:
UPDATE
    book
SET
    price = IF(buy =0, price * 0.9, price),
    buy = IF(buy > amount, amount, buy);

SELECT * FROM book

## 1.5.8 Запросы на обновление нескольких таблиц

Для тех книг в таблице **book** , которые есть в таблице **supply**, не только увеличить их количество в таблице **book** ( увеличить их количество на значение столбца **amount** таблицы **supply**), но и пересчитать их цену (для каждой книги найти сумму цен из таблиц **book** и **supply** и разделить на 2).

In [60]:
%%sql
UPDATE
    book, supply
SET
    book.amount = book.amount + supply.amount,
    book.price = (book.price + supply.price) / 2
WHERE
    book.title = supply.title AND
    book.author = supply.author;

 * mysql://root:***@localhost/mydb
2 rows affected.

[]

In [61]:
%%sql
SELECT * FROM book

 * mysql://root:***@localhost/mydb
5 rows affected.

[(1, 'Мастер и Маргарита', 'Булгаков М.А.', Decimal('670.99'), 3),
 (2, 'Белая гвардия', 'Булгаков М.А.', Decimal('540.50'), 12),
 (3, 'Идиот', 'Достоевский Ф.М.', Decimal('410.40'), 13),
 (4, 'Братья Карамазовы', 'Достоевский Ф.М.', Decimal('799.01'), 2),
 (5, 'Стихотворения и поэмы', 'Есенин С.А.', Decimal('650.00'), 15)]

## 1.5.9 Запросы на удаление

Возвращаем таблицу **book** к исходному состоянию.

In [63]:
%%sql
DELETE FROM book;
ALTER TABLE book AUTO_INCREMENT = 6;

INSERT INTO book(title, author, price, amount)
VALUES ('Мастер и Маргарита', 'Булгаков М.А.', 670.99, 3),
       ('Белая гвардия', 'Булгаков М.А.', 540.50, 5),
       ('Идиот', 'Достоевский Ф.М.', 460.00, 10),
       ('Братья Карамазовы', 'Достоевский Ф.М.', 799.01, 2),
       ('Стихотворения и поэмы', 'Есенин С.А.', 650.00, 15);

 * mysql://root:***@localhost/mydb
5 rows affected.
5 rows affected.

[]

Удалить из таблицы **supply** книги тех авторов, общее количество экземпляров книг которых в таблице **book** превышает 10.

In [65]:
%%sql
DELETE FROM
    supply
WHERE
    author IN (
        SELECT
            author
        FROM
            book
        GROUP BY
            author
        HAVING SUM(amount) > 10
    );

 * mysql://root:***@localhost/mydb
2 rows affected.

[]

In [66]:
%%sql
SELECT * FROM supply

 * mysql://root:***@localhost/mydb
2 rows affected.

[(1, 'Лирика', 'Пастернак Б.Л.', Decimal('518.99'), 2),
 (3, 'Белая гвардия', 'Булгаков М.А.', Decimal('540.50'), 7)]

## 1.5.10 Запросы на создание таблицы

Создать таблицу заказ (**ordering**), куда включить авторов и названия тех книг, количество экземпляров которых в таблице **book** меньше среднего количества экземпляров книг в таблице **book**. В таблицу включить столбец **amount**, в котором для всех книг указать одинаковое значение - среднее количество экземпляров книг в таблице **book**.

In [67]:
%%sql
CREATE TABLE ordering AS
SELECT
    author,
    title, 
    (
        SELECT ROUND(AVG(amount)) 
        FROM book
    ) AS amount
FROM book
WHERE amount < (
    SELECT ROUND(AVG(amount)) 
    FROM book);

 * mysql://root:***@localhost/mydb
3 rows affected.

[]

In [69]:
%%sql
SELECT * FROM ordering

 * mysql://root:***@localhost/mydb
3 rows affected.

[('Булгаков М.А.', 'Мастер и Маргарита', Decimal('7')),
 ('Булгаков М.А.', 'Белая гвардия', Decimal('7')),
 ('Достоевский Ф.М.', 'Братья Карамазовы', Decimal('7'))]